pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr59941.h
/* No control bits available or already defined for another module */

/*****************************************************************************
 eUSCI_B3 Registers
*****************************************************************************/

#define __MSP430_HAS_EUSCI_B3__               /* Definition to show that module is available */
#ifndef __MSP430_HAS_EUSCI_Bx__
#define __MSP430_HAS_EUSCI_Bx__
#endif
#define __MSP430_BASEADDRESS_EUSCI_B3__ 0x0700
#define EUSCI_B3_BASE          __MSP430_BASEADDRESS_EUSCI_B3__

sfr_w(UCB3CTLW0);                             /* eUSCI_Bx Control Word Register 0 */
sfr_b(UCB3CTLW0_L);
sfr_b(UCB3CTLW0_H);
sfr_w(UCB3CTLW1);                             /* eUSCI_Bx Control Word Register 1 */
sfr_b(UCB3CTLW1_L);
sfr_b(UCB3CTLW1_H);
sfr_w(UCB3BRW);                               /* eUSCI_Bx Baud Rate Control Word Register */
sfr_b(UCB3BRW_L);
sfr_b(UCB3BRW_H);
sfr_w(UCB3STATW);                             /* eUSCI_Bx Status Register */
sfr_b(UCB3STATW_L);
sfr_b(UCB3STATW_H);
sfr_w(UCB3TBCNT);                             /* eUSCI_Bx Byte Counter Threshold Register */
sfr_b(UCB3TBCNT_L);
sfr_b(UCB3TBCNT_H);
sfr_w(UCB3RXBUF);                             /* eUSCI_Bx Receive Buffer Register */
sfr_b(UCB3RXBUF_L);
sfr_b(UCB3RXBUF_H);
sfr_w(UCB3TXBUF);                             /* eUSCI_Bx Transmit Buffer Register */
sfr_b(UCB3TXBUF_L);
sfr_b(UCB3TXBUF_H);
sfr_w(UCB3I2COA0);                            /* eUSCI_Bx I2C Own Address 0 Register */
sfr_b(UCB3I2COA0_L);
sfr_b(UCB3I2COA0_H);
sfr_w(UCB3I2COA1);                            /* eUSCI_Bx I2C Own Address 1 Register */
sfr_b(UCB3I2COA1_L);
sfr_b(UCB3I2COA1_H);
sfr_w(UCB3I2COA2);                            /* eUSCI_Bx I2C Own Address 2 Register */
sfr_b(UCB3I2COA2_L);
sfr_b(UCB3I2COA2_H);
sfr_w(UCB3I2COA3);                            /* eUSCI_Bx I2C Own Address 3 Register */
sfr_b(UCB3I2COA3_L);
sfr_b(UCB3I2COA3_H);
sfr_w(UCB3ADDRX);                             /* eUSCI_Bx I2C Received Address Register */
sfr_b(UCB3ADDRX_L);
sfr_b(UCB3ADDRX_H);
sfr_w(UCB3ADDMASK);                           /* eUSCI_Bx I2C Address Mask Register */
sfr_b(UCB3ADDMASK_L);
sfr_b(UCB3ADDMASK_H);
sfr_w(UCB3I2CSA);                             /* eUSCI_Bx I2C Slave Address Register */
sfr_b(UCB3I2CSA_L);
sfr_b(UCB3I2CSA_H);
sfr_w(UCB3IE);                                /* eUSCI_Bx Interrupt Enable Register */
sfr_b(UCB3IE_L);
sfr_b(UCB3IE_H);
sfr_w(UCB3IFG);                               /* eUSCI_Bx Interrupt Flag Register */
sfr_b(UCB3IFG_L);
sfr_b(UCB3IFG_H);
sfr_w(UCB3IV);                                /* eUSCI_Bx Interrupt Vector Register */
sfr_b(UCB3IV_L);
sfr_b(UCB3IV_H);

/* eUSCI_B3 Register Offsets */
#define OFS_UCB3CTLW0                    (0x0000)
#define OFS_UCB3CTLW0_L                  OFS_UCB3CTLW0
#define OFS_UCB3CTLW0_H                  OFS_UCB3CTLW0+1
#define OFS_UCB3CTLW1                    (0x0002)
#define OFS_UCB3CTLW1_L                  OFS_UCB3CTLW1
#define OFS_UCB3CTLW1_H                  OFS_UCB3CTLW1+1
#define OFS_UCB3BRW                      (0x0006)
#define OFS_UCB3BRW_L                    OFS_UCB3BRW
#define OFS_UCB3BRW_H                    OFS_UCB3BRW+1
#define OFS_UCB3STATW                    (0x0008)
#define OFS_UCB3STATW_L                  OFS_UCB3STATW
#define OFS_UCB3STATW_H                  OFS_UCB3STATW+1
#define OFS_UCB3TBCNT                    (0x000A)
#define OFS_UCB3TBCNT_L                  OFS_UCB3TBCNT
#define OFS_UCB3TBCNT_H                  OFS_UCB3TBCNT+1
#define OFS_UCB3RXBUF                    (0x000C)
#define OFS_UCB3RXBUF_L                  OFS_UCB3RXBUF
#define OFS_UCB3RXBUF_H                  OFS_UCB3RXBUF+1
#define OFS_UCB3TXBUF                    (0x000E)
#define OFS_UCB3TXBUF_L                  OFS_UCB3TXBUF
#define OFS_UCB3TXBUF_H                  OFS_UCB3TXBUF+1
#define OFS_UCB3I2COA0                   (0x0014)
#define OFS_UCB3I2COA0_L                 OFS_UCB3I2COA0
#define OFS_UCB3I2COA0_H                 OFS_UCB3I2COA0+1
#define OFS_UCB3I2COA1                   (0x0016)
#define OFS_UCB3I2COA1_L                 OFS_UCB3I2COA1
#define OFS_UCB3I2COA1_H                 OFS_UCB3I2COA1+1
#define OFS_UCB3I2COA2                   (0x0018)
#define OFS_UCB3I2COA2_L                 OFS_UCB3I2COA2
#define OFS_UCB3I2COA2_H                 OFS_UCB3I2COA2+1
#define OFS_UCB3I2COA3                   (0x001A)
#define OFS_UCB3I2COA3_L                 OFS_UCB3I2COA3
#define OFS_UCB3I2COA3_H                 OFS_UCB3I2COA3+1
#define OFS_UCB3ADDRX                    (0x001C)
#define OFS_UCB3ADDRX_L                  OFS_UCB3ADDRX
#define OFS_UCB3ADDRX_H                  OFS_UCB3ADDRX+1
#define OFS_UCB3ADDMASK                  (0x001E)
#define OFS_UCB3ADDMASK_L                OFS_UCB3ADDMASK
#define OFS_UCB3ADDMASK_H                OFS_UCB3ADDMASK+1
#define OFS_UCB3I2CSA                    (0x0020)
#define OFS_UCB3I2CSA_L                  OFS_UCB3I2CSA
#define OFS_UCB3I2CSA_H                  OFS_UCB3I2CSA+1
#define OFS_UCB3IE                       (0x002A)
#define OFS_UCB3IE_L                     OFS_UCB3IE
#define OFS_UCB3IE_H                     OFS_UCB3IE+1
#define OFS_UCB3IFG                      (0x002C)
#define OFS_UCB3IFG_L                    OFS_UCB3IFG
#define OFS_UCB3IFG_H                    OFS_UCB3IFG+1
#define OFS_UCB3IV                       (0x002E)
#define OFS_UCB3IV_L                     OFS_UCB3IV
#define OFS_UCB3IV_H                     OFS_UCB3IV+1

/* No control bits available or already defined for another module */

/************************************************************
* TLV Descriptors
************************************************************/

#define __MSP430_HAS_TLV__                    /* Definition to show that Module is available */

#define TLV_START              (0x1A08)       /* Start Address of the TLV structure */
#define TLV_END                (0x1AFF)       /* End Address of the TLV structure */

#define TLV_LDTAG              (0x01)         /*  Legacy descriptor (1xx, 2xx, 4xx families) */
#define TLV_PDTAG              (0x02)         /*  Peripheral discovery descriptor */
#define TLV_Reserved3          (0x03)         /*  Future usage */
#define TLV_Reserved4          (0x04)         /*  Future usage */
#define TLV_BLANK              (0x05)         /*  Blank descriptor */
#define TLV_Reserved6          (0x06)         /*  Future usage */
#define TLV_Reserved7          (0x07)         /*  Serial Number */
#define TLV_DIERECORD          (0x08)         /*  Die Record  */
#define TLV_ADCCAL             (0x11)         /*  ADC12 calibration */
#define TLV_ADC12CAL           (0x11)         /*  ADC12 calibration */
#define TLV_ADC10CAL           (0x13)         /*  ADC10 calibration */
#define TLV_REFCAL             (0x12)         /*  REF calibration */
#define TLV_TAGEXT             (0xFE)         /*  Tag extender */
#define TLV_TAGEND             (0xFF)         //  Tag End of Table

/************************************************************
* Interrupt Vectors (offset from 0xFF80 + 0x10 for Password)
************************************************************/

#define LEA_VECTOR             (18)                     /* 0xFFB4 */
#define PORT8_VECTOR           (19)                     /* 0xFFB6 */
#define PORT7_VECTOR           (20)                     /* 0xFFB8 */
#define EUSCI_B3_VECTOR        (21)                     /* 0xFFBA */
#define EUSCI_B2_VECTOR        (22)                     /* 0xFFBC */
#define EUSCI_B1_VECTOR        (23)                     /* 0xFFBE */
#define EUSCI_A3_VECTOR        (24)                     /* 0xFFC0 */
#define EUSCI_A2_VECTOR        (25)                     /* 0xFFC2 */
#define PORT6_VECTOR           (26)                     /* 0xFFC4 */
#define PORT5_VECTOR           (27)                     /* 0xFFC6 */
#define TIMER4_A1_VECTOR       (28)                     /* 0xFFC8 */
#define TIMER4_A0_VECTOR       (29)                     /* 0xFFCA */
#define AES256_VECTOR          (30)                     /* 0xFFCC */
#define RTC_C_VECTOR           (31)                     /* 0xFFCE */
#define PORT4_VECTOR           (32)                     /* 0xFFD0 */
#define PORT3_VECTOR           (33)                     /* 0xFFD2 */
#define TIMER3_A1_VECTOR       (34)                     /* 0xFFD4 */
#define TIMER3_A0_VECTOR       (35)                     /* 0xFFD6 */
#define PORT2_VECTOR           (36)                     /* 0xFFD8 */
#define TIMER2_A1_VECTOR       (37)                     /* 0xFFDA */
#define TIMER2_A0_VECTOR       (38)                     /* 0xFFDC */
#define PORT1_VECTOR           (39)                     /* 0xFFDE */
#define TIMER1_A1_VECTOR       (40)                     /* 0xFFE0 */
#define TIMER1_A0_VECTOR       (41)                     /* 0xFFE2 */
#define DMA_VECTOR             (42)                     /* 0xFFE4 */
#define EUSCI_A1_VECTOR        (43)                     /* 0xFFE6 */
#define TIMER0_A1_VECTOR       (44)                     /* 0xFFE8 */
#define TIMER0_A0_VECTOR       (45)                     /* 0xFFEA */
#define ADC12_B_VECTOR         (46)                     /* 0xFFEC */
#define EUSCI_B0_VECTOR        (47)                     /* 0xFFEE */
#define EUSCI_A0_VECTOR        (48)                     /* 0xFFF0 */
#define WDT_VECTOR             (49)                     /* 0xFFF2 */
#define TIMER0_B1_VECTOR       (50)                     /* 0xFFF4 */
#define TIMER0_B0_VECTOR       (51)                     /* 0xFFF6 */
#define COMP_E_VECTOR          (52)                     /* 0xFFF8 */
#define UNMI_VECTOR            (53)                     /* 0xFFFA */
#define SYSNMI_VECTOR          (54)                     /* 0xFFFC */
#define RESET_VECTOR           ("reset")                /* 0xFFFE Reset (Highest Priority) */


/************************************************************
* Memory Boundary Definitions
************************************************************/

#define TINYRAM_START           0x000A
#define TINYRAM_LENGTH          0x0016
#define BSL_START               0x1000
#define BSL_LENGTH              0x0800
#define INFOD_START             0x1800
#define INFOD_LENGTH            0x0080
#define INFOC_START             0x1880
#define INFOC_LENGTH            0x0080
#define INFOB_START             0x1900
#define INFOB_LENGTH            0x0080
#define INFOA_START             0x1980
#define INFOA_LENGTH            0x0080
#define RAM_START               0x1C00
#define RAM_LENGTH              0x1000
#define LEARAM_START            0x2C00
#define LEARAM_LENGTH           0x1000
#define FRAM_START              0x4000
#define FRAM_LENGTH             0x40000

/************************************************************
* End of Modules
************************************************************/

#ifdef __cplusplus
}
#endif /* extern "C" */

#ifndef EXCLUDE_LEGACY
#include "legacy.h"
#endif

#endif /* #ifndef __MSP430FR59941 */


